cf_billing/DataProcessors/энргРаботаСПоследовательностямиСобытия.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>энргРаботаСПоследовательностямиСобытия</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

cf_billing/InformationRegisters/энргПредоставленныеПоказанияМКД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>энргПредоставленныеПоказанияМКД</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВСрок</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Показания</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПоказанияТекущегоПериода</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МКД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСтроения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПриборУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргПриборыУчетаАбонента</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Шкала</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргШкалыПриборовУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТарифнаяЗона</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргТарифныеЗоны</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерПозиции</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Разделитель</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаРегистратора</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокРегистратор</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.энргОперацияСПриборомУчетаМКД</v8:Type>
						<v8:Type>cfg:DocumentRef.энргОткрытиеМКД</v8:Type>
						<v8:Type>cfg:DocumentRef.энргСменаПоставщикаМКД</v8:Type>
						<v8:Type>cfg:DocumentRef.энргОперацияСУслугамиМКД</v8:Type>
						<v8:Type>cfg:DocumentRef.энргВводНачальныхОстатков</v8:Type>
						<v8:Type>cfg:DocumentRef.энргОбходнойЛистМКД</v8:Type>
						<v8:Type>cfg:DocumentRef.энргРегистрацияПоказанийМКД</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/InformationRegisters/энргНомераСтрокСтабильногоПериода.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>энргНомераСтрокСтабильногоПериода</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>НомерПозиции</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЧастныйСектор</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Строение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСтроения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Помещение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргПомещения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргВидыУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТочкаУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргТочкиУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаРегистратора</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокРегистратор</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.энргУстановитьЗначениеПлощади</v8:Type>
						<v8:Type>cfg:DocumentRef.УдалитьэнргПереводПомещенияВПомещениеСРазделеннымиЛС</v8:Type>
						<v8:Type>cfg:DocumentRef.энргСменаПоставщика</v8:Type>
						<v8:Type>cfg:DocumentRef.энргОперацияСУслугами</v8:Type>
						<v8:Type>cfg:DocumentRef.энргИстечениеДатыПоверкиПУ</v8:Type>
						<v8:Type>cfg:DocumentRef.энргУстановитьФормулуРасчетаТочекУчета</v8:Type>
						<v8:Type>cfg:DocumentRef.энргОперацияСЛицевымСчетом</v8:Type>
						<v8:Type>cfg:DocumentRef.энргУстановитьТехническуюВозможностьУстановкиПУ</v8:Type>
						<v8:Type>cfg:DocumentRef.энргОперацияСПриборомУчета</v8:Type>
						<v8:Type>cfg:DocumentRef.энргУстановитьСтатусАбонентовОтключаемыхВНеполивнойСезон</v8:Type>
						<v8:Type>cfg:DocumentRef.энргВводНачальныхОстатков</v8:Type>
						<v8:Type>cfg:DocumentRef.энргУстановитьКоличествоПроживающих</v8:Type>
						<v8:Type>cfg:DocumentRef.энргУстановитьКоличествоКомнат</v8:Type>
						<v8:Type>cfg:DocumentRef.энргУстановитьСхемуПодчиненностиТочекУчета</v8:Type>
						<v8:Type>cfg:DocumentRef.энргУстановитьВидБлагоустройстваАбонента</v8:Type>
						<v8:Type>cfg:DocumentRef.энргУстановитьВидДифференцированностиПриборУчета</v8:Type>
						<v8:Type>cfg:DocumentRef.энргУстановитьЗначениеТарифа</v8:Type>
						<v8:Type>cfg:DocumentRef.УдалитьэнргОперацияСРазделеннымиЛС</v8:Type>
						<v8:Type>cfg:DocumentRef.энргУстановитьТехническийСтатусТочкиУчета</v8:Type>
						<v8:Type>cfg:DocumentRef.энргИзменениеКоличестваПрописанныхПроживающихСобственников</v8:Type>
						<v8:Type>cfg:DocumentRef.энргУстановитьДатуПоверкиПУ</v8:Type>
						<v8:Type>cfg:DocumentRef.энргУстановитьЗначенияИзмерителей</v8:Type>
						<v8:Type>cfg:DocumentRef.энргУстановитьКоличествоПрописанных</v8:Type>
						<v8:Type>cfg:DocumentRef.энргСоглашениеОПотребленииВПомещении</v8:Type>
						<v8:Type>cfg:DocumentRef.энргУстановитьКоличествоСобственников</v8:Type>
						<v8:Type>cfg:DocumentRef.энргНачисление</v8:Type>
						<v8:Type>cfg:DocumentRef.энргПерерасчет</v8:Type>
						<v8:Type>cfg:DocumentRef.энргИзменениеЭтажностиСтроения</v8:Type>
						<v8:Type>cfg:DocumentRef.энргУстановитьГруппуПотребителейАбонента</v8:Type>
						<v8:Type>cfg:DocumentRef.энргУстановитьДополнительнуюСоциальнуюНорму</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УдалитьАбонент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргАбоненты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/InformationRegisters/энргСтабильныеПериодыШкалы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>энргСтабильныеПериодыШкалы</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВидДифференцированности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргВидыДифференцированности</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЧастныйСектор</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Строение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСтроения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Помещение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргПомещения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТочкаУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргТочкиУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерПозиции</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Шкала</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргШкалыПриборовУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаРегистратора</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокРегистратор</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.энргУстановитьЗначениеПлощади</v8:Type>
						<v8:Type>cfg:DocumentRef.УдалитьэнргПереводПомещенияВПомещениеСРазделеннымиЛС</v8:Type>
						<v8:Type>cfg:DocumentRef.энргСменаПоставщика</v8:Type>
						<v8:Type>cfg:DocumentRef.энргОперацияСУслугами</v8:Type>
						<v8:Type>cfg:DocumentRef.энргИстечениеДатыПоверкиПУ</v8:Type>
						<v8:Type>cfg:DocumentRef.энргУстановитьФормулуРасчетаТочекУчета</v8:Type>
						<v8:Type>cfg:DocumentRef.энргОперацияСЛицевымСчетом</v8:Type>
						<v8:Type>cfg:DocumentRef.энргОперацияСПриборомУчета</v8:Type>
						<v8:Type>cfg:DocumentRef.энргИзменитьДиаметрСеченияТочекУчета</v8:Type>
						<v8:Type>cfg:DocumentRef.энргИзменитьПлательщикаУслуги</v8:Type>
						<v8:Type>cfg:DocumentRef.энргУстановитьСтатусАбонентовОтключаемыхВНеполивнойСезон</v8:Type>
						<v8:Type>cfg:DocumentRef.энргВводНачальныхОстатков</v8:Type>
						<v8:Type>cfg:DocumentRef.энргУстановитьКоличествоПроживающих</v8:Type>
						<v8:Type>cfg:DocumentRef.энргУстановитьКоличествоКомнат</v8:Type>
						<v8:Type>cfg:DocumentRef.энргУстановитьСхемуПодчиненностиТочекУчета</v8:Type>
						<v8:Type>cfg:DocumentRef.энргУстановитьВидБлагоустройстваАбонента</v8:Type>
						<v8:Type>cfg:DocumentRef.энргУстановитьВидДифференцированностиПриборУчета</v8:Type>
						<v8:Type>cfg:DocumentRef.энргУстановитьЗначениеТарифа</v8:Type>
						<v8:Type>cfg:DocumentRef.УдалитьэнргОперацияСРазделеннымиЛС</v8:Type>
						<v8:Type>cfg:DocumentRef.энргУстановитьТехническийСтатусТочкиУчета</v8:Type>
						<v8:Type>cfg:DocumentRef.энргИзменениеКоличестваПрописанныхПроживающихСобственников</v8:Type>
						<v8:Type>cfg:DocumentRef.энргИзменитьПризнакРасчетаТолькоПоПоказаниям</v8:Type>
						<v8:Type>cfg:DocumentRef.энргУстановитьДатуПоверкиПУ</v8:Type>
						<v8:Type>cfg:DocumentRef.энргУстановитьЗначенияИзмерителей</v8:Type>
						<v8:Type>cfg:DocumentRef.энргУстановитьКоличествоПрописанных</v8:Type>
						<v8:Type>cfg:DocumentRef.энргСоглашениеОПотребленииВПомещении</v8:Type>
						<v8:Type>cfg:DocumentRef.энргУстановитьКоличествоСобственников</v8:Type>
						<v8:Type>cfg:DocumentRef.энргНачисление</v8:Type>
						<v8:Type>cfg:DocumentRef.энргПерерасчет</v8:Type>
						<v8:Type>cfg:DocumentRef.энргИзменениеЭтажностиСтроения</v8:Type>
						<v8:Type>cfg:DocumentRef.энргУстановитьГруппуПотребителейАбонента</v8:Type>
						<v8:Type>cfg:DocumentRef.энргУстановитьДополнительнуюСоциальнуюНорму</v8:Type>
						<v8:Type>cfg:DocumentRef.энргАктированиеНедопускаДопускаВПомещение</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УдалитьАбонент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргАбоненты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/Enums/энргСостояниеДокументаВПоследовательности.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>энргСостояниеДокументаВПоследовательности</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПроведенВПоследовательности</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроведенСНарушениемПоследовательности</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИсключенИзПоследовательности</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cf_billing/DataProcessors/энргРаботаСПоследовательностямиСобытия/Ext/ObjectModule.bsl
#Область ПрограммныйИнтерфейс

// Регистрирует в последовательности при записи.
//
// Параметры:
//  Источник	-	см в подписке.
//  Отказ		-	Булево.
//
Процедура ЗарегистрироватьВПоследовательностиПриЗаписи(Источник, Отказ) Экспорт
	
	Если Источник.ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	Если Источник.ДополнительныеСвойства.свойство("ВосстановлениеПоследовательности") тогда
		Возврат;
	КонецЕсли;
	
	Если Источник.ДополнительныеСвойства.свойство("РегистрироватьСтабильныеПериоды") тогда
		Если не Источник.ДополнительныеСвойства.РегистрироватьСтабильныеПериоды тогда
			Возврат;
		КонецЕсли;  		
	КонецЕсли;
	
	ЗарегестрироватьВПоследовательности(Источник, Отказ,"энргСтабильныеПериодыПоследовательность");
	
КонецПроцедуры

// Регистрирует МКД при записи в последовательности.
//
// Параметры:
//  Источник	-	см в подписке.
//  Отказ		-	Булево.
//
Процедура ЗарегистрироватьВПоследовательностиМКДПриЗаписи(Источник, Отказ) Экспорт
	
	Если Источник.ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	Если Источник.ДополнительныеСвойства.свойство("ВосстановлениеПоследовательности") тогда
		Возврат;
	КонецЕсли;
	
	ЗарегестрироватьВПоследовательности(Источник, Отказ,"энргСтабильныеПериодыМКДПоследовательность");
	
КонецПроцедуры

// Регистрирует показания ПУ при записи в последовательности.
//
// Параметры:
//  Источник	-	см в подписке.
//  Отказ		-	Булево.
//
Процедура ЗарегистрироватьВПоследовательностиПоказанияПУПриЗаписи(Источник, Отказ) Экспорт
	
	Если Источник.ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	Если Источник.ДополнительныеСвойства.свойство("ВосстановлениеПоследовательности") тогда
		Возврат;
	КонецЕсли;
	
	Если Источник.ДополнительныеСвойства.свойство("РегистрироватьПоказанияПУ") тогда
		Если не Источник.ДополнительныеСвойства.РегистрироватьПоказанияПУ тогда
			Возврат;
		КонецЕсли;  		
	КонецЕсли;
	
	Источник.МассивПриборов();
	
	//Набор = РегистрыСведений.энргПредоставленныеПоказания.СоздатьНаборЗаписей();
	//Набор.Отбор.ДокРегистратор.Установить(Источник.ссылка);
	//Набор.Записать();
	
	ЗарегестрироватьВПоследовательности(Источник, Отказ,"энргПоказанияПУПоследовательность");
	
КонецПроцедуры

// Регистрирует показания МКД при записи в последовательности.
//
// Параметры:
//  Источник	-	см в подписке.
//  Отказ		-	Булево.
//
Процедура ЗарегистрироватьВПоследовательностиПоказанияМКДПриЗаписи(Источник, Отказ) Экспорт
	
	Если Источник.ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	Если Источник.ДополнительныеСвойства.свойство("ВосстановлениеПоследовательности") тогда
		Возврат;
	КонецЕсли;	
	
	Источник.МассивПриборов();
	
	Набор = РегистрыСведений.энргПредоставленныеПоказанияМКД.СоздатьНаборЗаписей();
	Набор.Отбор.ДокРегистратор.Установить(Источник.ссылка);
	Набор.Записать();
	
	ЗарегестрироватьВПоследовательности(Источник, Отказ,"энргПоказанияПУПоследовательностьМКД");
	
КонецПроцедуры

// Регистрирует взаиморасчеты в последовательности.
//
// Параметры:
//  Источник	-	см в подписке.
//  Отказ		-	Булево.
//
Процедура ЗарегистрироватьВПоследовательностиВзаиморасчеты(Источник, Отказ) Экспорт
		
	Если Источник.ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если Источник.ДополнительныеСвойства.свойство("ВосстановлениеПоследовательности") тогда
		Возврат;
	КонецЕсли;	
	
	Если Источник.ДополнительныеСвойства.свойство("НеРегестрироватьВзаиморасчеты") тогда
		Если Источник.ДополнительныеСвойства.НеРегестрироватьВзаиморасчеты тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	Если Источник.ДополнительныеСвойства.свойство("ГруппаАбонентов") И Источник.ДополнительныеСвойства.ГруппаАбонентов Тогда
		Источник.ДанныеОплаты();
	КонецЕсли;
	
	ЗарегестрироватьВПоследовательности(Источник, Отказ,"энргВзаиморасчетыПоследовательность");
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗарегестрироватьВПоследовательности(Источник, Отказ,ИмяПоследовательности)
		
	ПараметрыПриЧтении  	= Новый Структура;
	ПараметрыПриЧтении.вставить("ДокРегистратор",Источник.ссылка);	
	ЭтоНовый 				= Источник.ДополнительныеСвойства.Свойство("ЭтоНовый") и Источник.ДополнительныеСвойства.ЭтоНовый;
	ДокументПроведен 		= Источник.Проведен;
	ПометкаУдаления 		= Источник.ПометкаУдаления;
	
	ОчищатьМаксимальныеПоказанияСрез 	= Источник.ДополнительныеСвойства.Свойство("ОчищатьМаксимальныеПоказанияСрез") и Источник.ДополнительныеСвойства.ОчищатьМаксимальныеПоказанияСрез;
	НаборЗаписей 						= РегистрыСведений[ИмяПоследовательности].СоздатьНаборЗаписей();
	для Каждого ЭлементОтбора из ПараметрыПриЧтении цикл
		Если ТипЗнч(ЭлементОтбора.Значение) = Тип("Массив") тогда
			Продолжить;
		КонецЕсли; 			
		НаборЗаписей.Отбор[ЭлементОтбора.ключ].установить(ЭлементОтбора.Значение);
	КонецЦикла;		
		
	// очищаем данные данные резултата проведения
	Если НЕ ЭтоНовый Тогда 
			
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	*
		|ИЗ
		|	РегистрСведений." + ИмяПоследовательности + " КАК ТаблицаПоследовательности
		|ГДЕ
		|	ТаблицаПоследовательности.ДокРегистратор = &ДокРегистратор";
		
		Запрос.УстановитьПараметр("ДокРегистратор", ПараметрыПриЧтении.ДокРегистратор); 	
		РезультатЗапроса = Запрос.Выполнить();		
		ТаблицаНабора = РезультатЗапроса.Выгрузить();
		НаборЗаписей.Загрузить(ТаблицаНабора);		
		
		Если ИмяПоследовательности = "энргСтабильныеПериодыПоследовательность" тогда
			РезультатПроведения  	= РегистрыСведений.энргСтабильныеПериоды.СоздатьНаборЗаписей();
			РезультатПроведения.Отбор.ДокРегистратор.установить(Источник.ссылка);
			РезультатПроведения.Записать();
			
			НаборНомераСтрок 		= РегистрыСведений.энргНомераСтрокСтабильногоПериода.СоздатьНаборЗаписей();
			НаборНомераСтрок.Отбор.ДокРегистратор.установить(Источник.ссылка);
			НаборНомераСтрок.Записать();
			
			НаборШкалы 				= РегистрыСведений.энргСтабильныеПериодыШкалы.СоздатьНаборЗаписей();
			НаборШкалы.Отбор.ДокРегистратор.установить(Источник.ссылка);
			НаборШкалы.Записать();
			
			НаборИзмерители 		= РегистрыСведений.энргСтабильныеПериодыИзмерителиНаправлений.СоздатьНаборЗаписей();
			НаборИзмерители.Отбор.ДокРегистратор.установить(Источник.ссылка);
			НаборИзмерители.Записать();
			
		ИначеЕсли ИмяПоследовательности = "энргСтабильныеПериодыМКДПоследовательность" тогда
			РезультатПроведения  	= РегистрыСведений.энргСтабильныеПериодыМКД.СоздатьНаборЗаписей();
			РезультатПроведения.Отбор.ДокРегистратор.установить(Источник.ссылка);
			РезультатПроведения.Записать();
			
			НаборНомераСтрок 		= РегистрыСведений.энргНомераСтрокСтабильногоПериодаМКД.СоздатьНаборЗаписей();
			НаборНомераСтрок.Отбор.ДокРегистратор.установить(Источник.ссылка);
			НаборНомераСтрок.Записать();	
			
			НаборШкалы 				= РегистрыСведений.энргСтабильныеПериодыМКДШкалы.СоздатьНаборЗаписей();
			НаборШкалы.Отбор.ДокРегистратор.установить(Источник.ссылка);
			НаборШкалы.Записать();
			
		ИначеЕсли ИмяПоследовательности = "энргПоказанияПУПоследовательность" тогда				
			
			РезультатПроведения  	= РегистрыСведений.энргПредоставленныеПоказания.СоздатьНаборЗаписей();
			РезультатПроведения.Отбор.ДокРегистратор.установить(Источник.ссылка);
			РезультатПроведения.Записать();	
			
			РезультатПроведения  	= РегистрыСведений.энргРасчетСреднегоОбъема.СоздатьНаборЗаписей();
			РезультатПроведения.Отбор.ДокРегистратор.установить(Источник.ссылка);
			РезультатПроведения.Записать();
			
			РезультатПроведения = РегистрыСведений.энргМаксимальныеПоказания.СоздатьНаборЗаписей();
			РезультатПроведения.Отбор.ДокРегистратор.Установить(Источник.ссылка);
			РезультатПроведения.Записать();
			
		ИначеЕсли ИмяПоследовательности = "бестСтабильныеПериодыПоследовательностьНП" тогда
			РезультатПроведения  = РегистрыСведений.бестСтабильныеПериодыПоследовательностьНП.СоздатьНаборЗаписей();
			РезультатПроведения.Отбор.ДокРегистратор.установить(Источник.ссылка);
			РезультатПроведения.Записать();	
		КонецЕсли;
			
		
	КонецЕсли;

	Если НЕ ДокументПроведен И НаборЗаписей.Количество() = 0 И НЕ Источник.Метаданные().Проведение = Метаданные.СвойстваОбъектов.Проведение.Запретить  Тогда
		// Документ непроведенный и прошлых записей в последовательности нет, поэтому менять нечего.
		Возврат;
	КонецЕсли;
	
	// Записи последовательности по прошлым организациям отметим, как требующие исключения.	
	ВГраница = НаборЗаписей.Количество() - 1;
	Для Сч = 0 По ВГраница Цикл
		
		Движение = НаборЗаписей[ВГраница - Сч];
		
		Если  ДокументПроведен ИЛИ (Источник.Метаданные().Проведение = Метаданные.СвойстваОбъектов.Проведение.Запретить и НЕ ПометкаУдаления) ИЛИ ОчищатьМаксимальныеПоказанияСрез Тогда
			// Для проведенного документа состояние в последовательности определяем отдельно.
			НаборЗаписей.Удалить(Движение);
		ИначеЕсли Движение.СостояниеПроведения <> Перечисления.энргСостояниеДокументаВПоследовательности.ИсключенИзПоследовательности ИЛИ ПометкаУдаления Тогда
			Движение.СостояниеПроведения = Перечисления.энргСостояниеДокументаВПоследовательности.ИсключенИзПоследовательности;
		КонецЕсли;

	КонецЦикла;
	
	Если  ДокументПроведен ИЛИ (Источник.Метаданные().Проведение = Метаданные.СвойстваОбъектов.Проведение.Запретить И Не Источник.ПометкаУдаления) ИЛИ ОчищатьМаксимальныеПоказанияСрез  тогда
		
		Если Источник.ДополнительныеСвойства.свойство("ГруппаАбонентов") тогда
			Если  Источник.ДополнительныеСвойства.ГруппаАбонентов тогда
				ЗарегестрироватьВПоследовательностиГруппуАбонентов(Источник,НаборЗаписей,ИмяПоследовательности);
			КонецЕсли;
						
		иначе
			ПараметрыПроведения  	= Источник.ДополнительныеСвойства.ПараметрыПроведения;		
			ПараметрыПроведения.вставить("ОчищатьМаксимальныеПоказанияСрез",ОчищатьМаксимальныеПоказанияСрез);
			Если не ПараметрыПроведения.свойство("ДокРегистратор") тогда 
				ПараметрыПроведения.вставить("ДокРегистратор",Источник.ссылка);
			КонецЕсли;
			
			ПараметрыПроведения.Вставить(
				"ПроверятьСостояниеПоследовательностиВПолеВыборки", 
				ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Источник.ДополнительныеСвойства, "ПроверятьСостояниеПоследовательностиВПолеВыборки", Ложь));

			СостояниеПроведения 	= Перечисления.энргСостояниеДокументаВПоследовательности.ПроведенСНарушениемПоследовательности;
			
			Если Источник.ДополнительныеСвойства.Свойство("ПроведенВХронологическойПоследовательности") Тогда
				Если Источник.ДополнительныеСвойства.ПроведенВХронологическойПоследовательности Тогда
					СостояниеПроведения = Перечисления.энргСостояниеДокументаВПоследовательности.ПроведенВПоследовательности;
				КонецЕсли;
			КонецЕсли;
			
			Если ИмяПоследовательности = "энргПоказанияПУПоследовательность" И Источник.ДополнительныеСвойства.Свойство("ПериодРегистрацииПоказаний") тогда
				ПериодРегистрации 	=  Источник.ДополнительныеСвойства.ПериодРегистрацииПоказаний;
			Иначе	
				ПериодРегистрации 	= Источник.дата;
			КонецЕсли;
						
			Если ПараметрыПроведения.свойство("ПериодРегистрации") тогда
				ПериодРегистрации = ПараметрыПроведения.ПериодРегистрации;
			КонецЕсли;
			
			Если Источник.ДополнительныеСвойства.свойство("МассивПриборов") тогда
				ПараметрыПроведения.вставить("МассивПриборовУчета",Источник.ДополнительныеСвойства.МассивПриборов);
			КонецЕсли;
			
			Если найти(ИмяПоследовательности,"НП") <> 0 тогда 
				ЗначенияИзмерений 						= Новый Структура(
				"Дата,Регистратор,ПериодНачисления,ПериодРегистрации,
				|Организация, Район, Договор, СостояниеПроведения,ПараметрыПроведения",
				Источник.Дата,Источник.Ссылка,ПараметрыПроведения.ПериодНачисления,ПериодРегистрации,
				ПараметрыПроведения.Организация,ПараметрыПроведения.Район,ПараметрыПроведения.Договор,СостояниеПроведения,ПараметрыПроведения);
			Иначе
				ЗначенияИзмерений 						= Новый Структура(
				"Дата,Регистратор,ПериодНачисления,ПериодРегистрации,
				|Организация, Район,СостояниеПроведения,ПараметрыПроведения",
				Источник.Дата,Источник.Ссылка,ПараметрыПроведения.ПериодНачисления,ПериодРегистрации,
				ПараметрыПроведения.Организация, ПараметрыПроведения.Район,СостояниеПроведения,ПараметрыПроведения);
			КонецЕсли;
			
			
			Если найти(ИмяПоследовательности,"МКД") <> 0 тогда 				
				ЗаполнитьЗначенияИзмеренийМКД(ИмяПоследовательности,НаборЗаписей,ЗначенияИзмерений);
			ИначеЕсли НЕ СтрНайти(ИмяПоследовательности,"Взаиморасчеты") = 0 Тогда
				Если ТипЗнч(Источник) = Тип("ДокументОбъект.энргНачислениеПени") Тогда
					ЗаполнитьЗначенияИзмеренийНачислениеПени(ИмяПоследовательности,НаборЗаписей,ЗначенияИзмерений);
				Иначе
					ЗначенияИзмерений.Вставить("Абонент",Источник.Абонент);																									
					ЗаполнитьЗначенияИзмерений(ИмяПоследовательности,НаборЗаписей,ЗначенияИзмерений);
				КонецЕсли;
			Иначе				
				ЗначенияИзмерений.Вставить("Помещение",ПараметрыПроведения.Помещение);																									
				ЗаполнитьЗначенияИзмерений(ИмяПоследовательности,НаборЗаписей,ЗначенияИзмерений);
			КонецЕсли;	
			
			Если Источник.ДополнительныеСвойства.свойство("РазделенныйЛС") тогда
				Если  Источник.ДополнительныеСвойства.РазделенныйЛС тогда
					
					Если ЗначениеЗаполнено(ПараметрыПроведения.Помещение.Родитель) И ИмяПоследовательности = "энргСтабильныеПериодыПоследовательность" Тогда
						РодительПомещения = ПараметрыПроведения.Помещение.Родитель;
						Помещение = ПараметрыПроведения.Помещение;
						
						Запрос = Новый Запрос;
						Запрос.Текст = 
						"ВЫБРАТЬ
						|	энргПомещения.Ссылка КАК Ссылка
						|ИЗ
						|	Справочник.энргПомещения КАК энргПомещения
						|ГДЕ
						|	энргПомещения.Ссылка В ИЕРАРХИИ(&РодительПомещения)
						|	И энргПомещения.Ссылка <> &Помещение
						|	И НЕ энргПомещения.ПометкаУдаления";
						
						Запрос.УстановитьПараметр("Помещение", Помещение);
						Запрос.УстановитьПараметр("РодительПомещения", РодительПомещения);
						
						РезультатЗапроса = Запрос.Выполнить();
						
						ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
						
						Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
							ПараметрыПроведения.Вставить("Помещение", ВыборкаДетальныеЗаписи.Ссылка);																								
							ЗаполнитьЗначенияИзмерений(ИмяПоследовательности,НаборЗаписей,ЗначенияИзмерений);
						КонецЦикла;
						
						
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли; 	
	НаборЗаписей.Записать(); 	
КонецПроцедуры

Процедура ЗаполнитьЗначенияИзмерений(ИмяПоследовательности, НаборЗаписей, ЗначенияИзмерений)
		
	ПараметрыПроведения 	= ЗначенияИзмерений.ПараметрыПроведения;
	ПроверятьСПВПолеВыборки = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ПараметрыПроведения, "ПроверятьСостояниеПоследовательностиВПолеВыборки", Ложь);
	ОчищатьМаксимальныеПоказанияСрез = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ПараметрыПроведения, "ОчищатьМаксимальныеПоказанияСрез", Ложь);
				
	Если ИмяПоследовательности = "энргПоказанияПУПоследовательность" Тогда		
		Выборка  								= ПараметрыПроведения.МассивПриборовУчета.выбрать();
		Пока Выборка.следующий() цикл 
			Движение 							= НаборЗаписей.Добавить();
			// Измерения
			//Если ПараметрыПроведения.Свойство("ОчищатьМаксимальныеПоказанияСрез") и ПараметрыПроведения.ОчищатьМаксимальныеПоказанияСрез Тогда
			Если ОчищатьМаксимальныеПоказанияСрез Тогда
				Движение.ПериодНачисления 		= Выборка.ПериодНачисления;
			Иначе
				Движение.ПериодНачисления 		= ЗначенияИзмерений.ПериодНачисления;
			КонецЕсли;
			Движение.Организация 	 			= ЗначенияИзмерений.Организация;
			Движение.Район 						= ЗначенияИзмерений.Район;
			Движение.ЧастныйСектор         	 	= ПараметрыПроведения.ЧастныйСектор;
			Движение.Строение              	 	= ПараметрыПроведения.Строение;
			Движение.Помещение 					= ПараметрыПроведения.Помещение;
			Движение.ПриборУчета				= Выборка.ПриборУчета;
			Движение.Разделитель				= Выборка.Разделитель;
			Если ПроверятьСПВПолеВыборки и ЗначениеЗаполнено(Выборка.СостояниеПроведения) Тогда
				Движение.СостояниеПроведения 	= Выборка.СостояниеПроведения;
			Иначе
				Движение.СостояниеПроведения 	= ЗначенияИзмерений.СостояниеПроведения;
			КонецЕсли;			
			Движение.ПериодРегистрации 			= ЗначенияИзмерений.ПериодРегистрации;
			Движение.ДокРегистратор 			= ЗначенияИзмерений.Регистратор;
			Движение.ДатаРегистратора 			= ЗначенияИзмерений.Дата;
			Движение.ВыводПрибораУчета 			= Выборка.ВыводПрибораУчета;
			Движение.ИмяТабЧасти 				= Выборка.ИмяТабЧасти;
		КонецЦикла; 		
	ИначеЕсли ИмяПоследовательности = "энргСтабильныеПериодыПоследовательность" тогда
		Движение 								= НаборЗаписей.Добавить();
		Движение.Организация 	 				= ЗначенияИзмерений.Организация;
		Движение.ПериодНачисления 				= ЗначенияИзмерений.ПериодНачисления;
		Движение.Район 							= ЗначенияИзмерений.Район;
		Движение.ЧастныйСектор         	 		= ПараметрыПроведения.ЧастныйСектор;
		Движение.Строение              	 		= ПараметрыПроведения.Строение;
		Движение.Помещение 						= ПараметрыПроведения.Помещение;
		Движение.ПериодРегистрации 				= ЗначенияИзмерений.ПериодРегистрации;
		Движение.СостояниеПроведения 			= ЗначенияИзмерений.СостояниеПроведения;
		Движение.ДокРегистратор 				= ЗначенияИзмерений.Регистратор;
		Движение.ДатаРегистратора 				= ЗначенияИзмерений.Дата; 
	иначе
		Движение 								= НаборЗаписей.Добавить();
		Движение.Организация 	 				= ЗначенияИзмерений.Организация;
		Движение.ПериодНачисления 				= ЗначенияИзмерений.ПериодНачисления;
		Движение.Район 							= ЗначенияИзмерений.Район;
		Движение.МКД         	 				= ?(Не ПараметрыПроведения.ЧастныйСектор, ПараметрыПроведения.Строение, Справочники.энргСтроения.ПустаяСсылка());
		Движение.Абонент 						= ЗначенияИзмерений.Абонент;
		Движение.СостояниеПроведения 			= ЗначенияИзмерений.СостояниеПроведения;
		Движение.ДокРегистратор 				= ЗначенияИзмерений.Регистратор;
		Движение.ДатаРегистратора 				= ЗначенияИзмерений.Дата; 
		Движение.ЭтоОплата 						= ПараметрыПроведения.ЭтоОплата;
		Движение.Кассир 						= ПараметрыПроведения.Кассир;
		Движение.ИсточникПоступления 			= ПараметрыПроведения.ИсточникПоступления;
	КонецЕсли; 	
КонецПроцедуры

Процедура ЗаполнитьЗначенияИзмеренийМКД(ИмяПоследовательности,НаборЗаписей,ЗначенияИзмерений)
	
	ПараметрыПроведения 					= ЗначенияИзмерений.ПараметрыПроведения;
	Если ИмяПоследовательности = "энргПоказанияПУПоследовательностьМКД" Тогда 
		Выборка  							= ПараметрыПроведения.МассивПриборовУчета.выбрать();
		Пока Выборка.следующий() цикл
			Движение 						= НаборЗаписей.Добавить();
			// Измерения
			Движение.Организация 	 		= ЗначенияИзмерений.Организация;
			Движение.ПериодНачисления 		= ЗначенияИзмерений.ПериодНачисления;
			Движение.Район 					= ЗначенияИзмерений.Район;
			Движение.МКД                    = ПараметрыПроведения.МКД;
			Движение.ПриборУчета			= Выборка.ПриборУчета;
			Движение.Разделитель			= Выборка.Разделитель;
			Движение.СостояниеПроведения 	= ЗначенияИзмерений.СостояниеПроведения;
			Движение.ПериодРегистрации 		= ЗначенияИзмерений.ПериодРегистрации;
			Движение.ДокРегистратор 		= ЗначенияИзмерений.Регистратор;
			Движение.ДатаРегистратора 		= ЗначенияИзмерений.Дата;
			Движение.ВыводПрибораУчета 		= Выборка.ВыводПрибораУчета;
			Движение.ИмяТабЧасти 			= Выборка.ИмяТабЧасти;
		КонецЦикла; 		
	иначе
		Движение 							= НаборЗаписей.Добавить();
		Движение.Организация 	 			= ЗначенияИзмерений.Организация;
		Движение.ПериодНачисления 			= ЗначенияИзмерений.ПериодНачисления;
		Движение.Район 						= ЗначенияИзмерений.Район;
		Движение.МКД                   		= ПараметрыПроведения.МКД; 		
		Движение.ПериодРегистрации 			= ЗначенияИзмерений.ПериодРегистрации;
		Движение.СостояниеПроведения 		= ЗначенияИзмерений.СостояниеПроведения;
		Движение.ДокРегистратор 			= ЗначенияИзмерений.Регистратор;
		Движение.ДатаРегистратора 			= ЗначенияИзмерений.Дата;  		
	КонецЕсли; 	
КонецПроцедуры

Процедура ЗарегестрироватьВПоследовательностиГруппуАбонентов(Источник,НаборЗаписей,ИмяПоследовательности)
	
	СостояниеПроведения  									= Перечисления.энргСостояниеДокументаВПоследовательности.ПроведенСНарушениемПоследовательности;
	СоответствиеСостояния 									= Новый Структура("СостояниеПроведения", Перечисления.энргСостояниеДокументаВПоследовательности.ПроведенСНарушениемПоследовательности);
	Если ИмяПоследовательности ="энргПоказанияПУПоследовательность" тогда
		ДанныеДляПроведения  								= Источник.ДополнительныеСвойства.МассивПриборов;
		
		Выборка  											= ДанныеДляПроведения.выбрать();
		
		ТекКлючПомещения  									= Неопределено;
		ТекПриборУчета 										= Неопределено;
		ТекТарифнаяЗона 									= Неопределено;
		ТекРазделитель 										= 0;		
		Пока Выборка.следующий() цикл
			
			Если ТекКлючПомещения = Выборка.КлючПомещения и ТекПриборУчета = Выборка.ПриборУчета тогда
				ТекРазделитель 								= ТекРазделитель + 1;
			иначе
				ТекРазделитель 								= 0;
			КонецЕсли; 
			СтрокаНабора  									= НаборЗаписей.добавить();
			СтрокаНабора.Организация 	 					= Выборка.Организация;
			СтрокаНабора.ПериодНачисления  					= Выборка.ПериодНачисления;
			СтрокаНабора.Район  							= Выборка.Район;
			ЗаполнитьЗначенияСвойств(СоответствиеСостояния, Выборка);
			СтрокаНабора.СостояниеПроведения  				= СоответствиеСостояния.СостояниеПроведения;
			СтрокаНабора.ЧастныйСектор		  				= Выборка.ЧастныйСектор;
			СтрокаНабора.Строение			  				= Выборка.Строение;
			СтрокаНабора.Помещение			  				= Выборка.Помещение;
			СтрокаНабора.ПриборУчета		  				= Выборка.ПриборУчета;
			СтрокаНабора.ПериодРегистрации	  				= Выборка.ПериодРегистрации;
			СтрокаНабора.ДатаРегистратора	  				= Источник.Дата;
			СтрокаНабора.ДокРегистратор	  					= Источник.ссылка;
			СтрокаНабора.ИмяТабЧасти	  					= Выборка.ИмяТабЧасти;
			СтрокаНабора.Разделитель	  					= ТекРазделитель;
			
			ТекКлючПомещения  								= Выборка.КлючПомещения;
			ТекПриборУчета 									= Выборка.ПриборУчета;
		//	ТекТарифнаяЗона 								= Выборка.ТарифнаяЗона;
		КонецЦикла; 		
	ИначеЕсли ИмяПоследовательности = "энргСтабильныеПериодыПоследовательность" тогда
		
		Источник.МассивПомещений();
		
		ДанныеДляПроведения  								= Источник.ДополнительныеСвойства.МассивПомещений;
		
		Выборка  											= ДанныеДляПроведения.выбрать();
		
		Пока Выборка.следующий() цикл
			СтрокаНабора 									= НаборЗаписей.Добавить();
			СтрокаНабора.Организация 	 					= Выборка.Организация;
			СтрокаНабора.ПериодНачисления 					= Выборка.ПериодНачисления;
			СтрокаНабора.Район 								= Выборка.Район;
			СтрокаНабора.ЧастныйСектор         	 			= Выборка.ЧастныйСектор;
			СтрокаНабора.Строение              	 			= Выборка.Строение;
			СтрокаНабора.Помещение 							= Выборка.Помещение;
			СтрокаНабора.ПериодРегистрации 					= Выборка.ПериодРегистрации;
			СтрокаНабора.СостояниеПроведения 				= СостояниеПроведения;
			СтрокаНабора.ДокРегистратор 					= Источник.ссылка;
			СтрокаНабора.ДатаРегистратора 					= Источник.Дата; 
			
		КонецЦикла;	
		
	ИначеЕсли ИмяПоследовательности ="энргВзаиморасчетыПоследовательность" тогда
		ДанныеДляПроведения  								= Источник.ДополнительныеСвойства.ДанныеОплаты;
		ИсточникПоступления 								= Источник.ДополнительныеСвойства.ИсточникПоступления;
		Выборка  											= ДанныеДляПроведения.выбрать();
		
		Пока Выборка.следующий() цикл
			СтрокаНабора 									= НаборЗаписей.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаНабора,Выборка);
			СтрокаНабора.СостояниеПроведения 				= СостояниеПроведения;
			СтрокаНабора.ДокРегистратор 					= Источник.ссылка;
			СтрокаНабора.ДатаРегистратора 					= Выборка.Дата;			
			СтрокаНабора.ИсточникПоступления 				= ИсточникПоступления;			
		КонецЦикла;		
	КонецЕсли; 	
	
			
КонецПроцедуры

Процедура ЗаполнитьЗначенияИзмеренийНачислениеПени(ИмяПоследовательности,НаборЗаписей,ЗначенияИзмерений)
		
	ПараметрыПроведения 					= ЗначенияИзмерений.ПараметрыПроведения;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	энргНачислениеПениДанныеНачислений.Абонент КАК Абонент
		|ИЗ
		|	Документ.энргНачислениеПени.ДанныеНачислений КАК энргНачислениеПениДанныеНачислений
		|ГДЕ
		|	энргНачислениеПениДанныеНачислений.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", ЗначенияИзмерений.Регистратор);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Движение 								= НаборЗаписей.Добавить();
		Движение.Организация 	 				= ЗначенияИзмерений.Организация;
		Движение.ПериодНачисления 				= ЗначенияИзмерений.ПериодНачисления;
		Движение.Район 							= ЗначенияИзмерений.Район;
		Движение.МКД         	 				= ПараметрыПроведения.МКД;
		Движение.Абонент 						= ВыборкаДетальныеЗаписи.Абонент;
		Движение.СостояниеПроведения 			= ЗначенияИзмерений.СостояниеПроведения;
		Движение.ДокРегистратор 				= ЗначенияИзмерений.Регистратор;
		Движение.ДатаРегистратора 				= ЗначенияИзмерений.Дата; 
		Движение.ЭтоОплата 						= ПараметрыПроведения.ЭтоОплата;
		Движение.Кассир 						= ПараметрыПроведения.Кассир;
		Движение.ИсточникПоступления 			= ПараметрыПроведения.ИсточникПоступления;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
